# Дана строка, состоящая из слов, разделенных пробелами.
# Определите, сколько в ней слов.
# Формат ввода
# Вводится строка.
# Формат вывода
# Выведите ответ на задачу.

h = input()

s = h.count(' ', 0)
print(s+1)

