# Дана строка. Удалите из этой строки все символы @.
# Формат ввода
# Вводится строка.
# Формат вывода
# Выведите ответ на задачу.

h = input()
print(h.replace('@', ''))
