# По данному числу n вычислите сумму
# (1 / 1²)+(1 / 2²)+(1 / 3²)+...+(1 / n²).
# Формат ввода
# Вводится целое положительное число.
# Формат вывода
# Выведите ответ на задачу.

import math
n = float(input())
m = int(n)
p = 0
round    
p = n % m
print('{0:.6f}'.format(p))
