# Дана строка. Замените в этой строке все цифры 1 на слово one.
# Формат ввода
# Вводится строка.
# Формат вывода
# Выведите ответ на задачу.

h = input()
print(h.replace('1', 'one'))
