"""print('1', '2', '3', sep=' - ', end=' ')"""       """Команда sep - делает разделение между симвалами"""
"""  print('=', 1+2+3)"""                            """Команда end - делает перенос на следующую строчку"""


"""print(11 + 6)
print(11 - 6)
print(11 * 6)
print(11**6)  степень
print(11 // 6)  целое деление
print(11 % 6)   остаток от деления"""


'''speed = 108
time = 12
dist = time * speed
print(dist)'''

'''goodByePhrase = 'Hasta la vista'
person = 'baby'
print(goodByePhrase + ', ' + person + '!')'''

'''answer = '2 + 3 = ' + str(2 + 3)
print(answer)'''

'''Можно умножить строку на целое неотрицательное число, в результате получится исходная строка, повторенная заданное число раз:
word = 'Bye'
phrase = word * 3 + '!'
print(phrase)'''

'''name = input()
print('I love', name)'''

'''a = int(input())
b = int(input())
print(a + b)

В строках могут быть не только буквы, цифры и прочие знаки препинания, но и, например, символы табуляции и перевода строки. 
Чтобы использовать эти символы в константной строке в коде программы необходимо записывать их как \t и \n соответственно.
'''

'''Exercise 1'''

name = input()
print('Hello, ', name,'!')

