# Формат ввода
# Вводится единственное число (гарантируется, что оно
# соответствует условию задачи).
# Формат вывода
# Выведите ответ на задачу.

N = int(input())
print(N//10)
