# a = int(input())
# b = int(input())
# c = int(input())
# d = int(input())
# cost1 = a * 100 + b
# cost2 = c * 100 + d
# totalCost = cost1 + cost2
# print(totalCost // 100, totalCost % 100)

# Пусть есть два товара, первый из них стоит A рублей B копеек, а второй - C рублей D копеек. Сколько рублей и копеек стоят эти товары вместе.
# В нашей задаче наименьшей единицей являются копейки, поэтому все цены следует перевести в них, затем сложить их, а затем перевести результат 
# обратно в рубли и копейки. Код решения будет выглядеть так:



# n = int(input())
# print(n % 256)