# Заданное число N записали 100 раз подряд и затем возвели в квадрат.
#  Что получилось?
# Формат ввода
# Вводится целое неотрицательное число N не превышающее 1000.
# Формат вывода
# Выведите ответ на задачу.

n = int(input())
print((int(str(n) * 100))**2)
